#language: ru

@tree
@ДвиженияДокументов

Функционал: проверка движения документов Поступление товаров

Как Тестироващик я хочу
проверить движения документа Поступление товаров 
чтобы убедиться что документ делает движения по регистрам   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: _0561 подготовитлельный сценарий (движения документа Поступления товаров)
	Когда экспорт основных данных
	Когда загрузка документа Поступление товаров и услуг
	И я выполняю код встроенного языка на сервере
		|'Документы.PurchaseInvoice.НайтиПоНомеру(1001).ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);'|

Сценарий: _0502 проверка движений документа Поступление товаров по регистру	R1001 Закупки
	Дано Я открываю навигационную ссылку "e1cib/list/Document.PurchaseInvoice"
	И в таблице "List" я перехожу к строке
		| 'Номер' |
		| '1 001' | 
	И я нажимаю на кнопку с именем 'FormReportDocumentRegistrationsReportRegistrationsReport'
	Тогда открылось окно 'Движения документа'
	И из выпадающего списка с именем "FilterRegister" я выбираю точное значение 'R1001 Закупки'
	И я нажимаю на кнопку с именем 'GenerateReport'
	Тогда табличный документ "ResultTable" равен:
		| 'Поступление товаров и услуг 1 001 от 29.08.2023 11:26:40' | ''                    | ''           | ''      | ''                  | ''             | ''                       | ''                          | ''                             | ''       | ''                                                         | ''                        | ''                                     | ''                  |
		| 'Движения документа по регистрам'                          | ''                    | ''           | ''      | ''                  | ''             | ''                       | ''                          | ''                             | ''       | ''                                                         | ''                        | ''                                     | ''                  |
		| 'Регистр  "R1001 Закупки"'                                 | ''                    | ''           | ''      | ''                  | ''             | ''                       | ''                          | ''                             | ''       | ''                                                         | ''                        | ''                                     | ''                  |
		| ''                                                         | 'Period'              | 'Resources'  | ''      | ''                  | ''             | 'Dimensions'             | ''                          | ''                             | ''       | ''                                                         | ''                        | ''                                     | 'Attributes'        |
		| ''                                                         | ''                    | 'Количество' | 'Сумма' | 'Сумма без налогов' | 'Сумма скидки' | 'Организация'            | 'Структурное подразделение' | 'Вид мультивалютной аналитики' | 'Валюта' | 'Инвойс'                                                   | 'Характеристика'          | 'Ключ строки'                          | 'Отложенный расчет' |
		| ''                                                         | '29.08.2023 11:26:40' | '1'          | ''      | ''                  | ''             | 'Собственная компания 1' | ''                          | 'В валюте бюджетирования'      | 'EUR'    | 'Поступление товаров и услуг 1 001 от 29.08.2023 11:26:40' | 'Услуга'                  | '6b955de9-2aa5-4915-b493-15943902cb5f' | 'Да'                |
		| ''                                                         | '29.08.2023 11:26:40' | '1'          | '171,8' | '143,17'            | ''             | 'Собственная компания 1' | ''                          | 'В локальной валюте страны'    | 'EUR'    | 'Поступление товаров и услуг 1 001 от 29.08.2023 11:26:40' | 'Услуга'                  | '6b955de9-2aa5-4915-b493-15943902cb5f' | 'Нет'               |
		| ''                                                         | '29.08.2023 11:26:40' | '1'          | '200'   | '166,67'            | ''             | 'Собственная компания 1' | ''                          | 'ru наименование не заполнено' | 'USD'    | 'Поступление товаров и услуг 1 001 от 29.08.2023 11:26:40' | 'Услуга'                  | '6b955de9-2aa5-4915-b493-15943902cb5f' | 'Нет'               |
		| ''                                                         | '29.08.2023 11:26:40' | '1'          | '200'   | '166,67'            | ''             | 'Собственная компания 1' | ''                          | 'В валюте отчетности'          | 'USD'    | 'Поступление товаров и услуг 1 001 от 29.08.2023 11:26:40' | 'Услуга'                  | '6b955de9-2aa5-4915-b493-15943902cb5f' | 'Нет'               |
		| ''                                                         | '29.08.2023 11:26:40' | '1'          | '200'   | '166,67'            | ''             | 'Собственная компания 1' | ''                          | 'Валюта соглашения, USD'       | 'USD'    | 'Поступление товаров и услуг 1 001 от 29.08.2023 11:26:40' | 'Услуга'                  | '6b955de9-2aa5-4915-b493-15943902cb5f' | 'Нет'               |
		| ''                                                         | '29.08.2023 11:26:40' | '2'          | ''      | ''                  | ''             | 'Собственная компания 1' | ''                          | 'В валюте бюджетирования'      | 'EUR'    | 'Поступление товаров и услуг 1 001 от 29.08.2023 11:26:40' | 'Товар без характеристик' | '835430cb-a604-40a3-9f28-7e33dc154ccd' | 'Да'                |
		| ''                                                         | '29.08.2023 11:26:40' | '2'          | '171,8' | '143,17'            | ''             | 'Собственная компания 1' | ''                          | 'В локальной валюте страны'    | 'EUR'    | 'Поступление товаров и услуг 1 001 от 29.08.2023 11:26:40' | 'Товар без характеристик' | '835430cb-a604-40a3-9f28-7e33dc154ccd' | 'Нет'               |
		| ''                                                         | '29.08.2023 11:26:40' | '2'          | '200'   | '166,67'            | ''             | 'Собственная компания 1' | ''                          | 'ru наименование не заполнено' | 'USD'    | 'Поступление товаров и услуг 1 001 от 29.08.2023 11:26:40' | 'Товар без характеристик' | '835430cb-a604-40a3-9f28-7e33dc154ccd' | 'Нет'               |
		| ''                                                         | '29.08.2023 11:26:40' | '2'          | '200'   | '166,67'            | ''             | 'Собственная компания 1' | ''                          | 'В валюте отчетности'          | 'USD'    | 'Поступление товаров и услуг 1 001 от 29.08.2023 11:26:40' | 'Товар без характеристик' | '835430cb-a604-40a3-9f28-7e33dc154ccd' | 'Нет'               |
		| ''                                                         | '29.08.2023 11:26:40' | '2'          | '200'   | '166,67'            | ''             | 'Собственная компания 1' | ''                          | 'Валюта соглашения, USD'       | 'USD'    | 'Поступление товаров и услуг 1 001 от 29.08.2023 11:26:40' | 'Товар без характеристик' | '835430cb-a604-40a3-9f28-7e33dc154ccd' | 'Нет'               |
	И я закрываю все окна клиентского приложения
		
			

	
		
				